Revit 2027 API
Hardwood.HardwoodImperfections Property
 The property labeled "Relief Pattern" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodImperfections { get; }
Public Shared ReadOnly Property HardwoodImperfections As String
	Get
public:
static property String^ HardwoodImperfections {
	String^ get ();
}
static member HardwoodImperfections : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace